Revit 2024 API
MEPSection Class
 A section in the Autodesk Revit MEP product.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class MEPSection : IDisposable
Visual Basic
Public Class MEPSection _
	Implements IDisposable
Visual C++
public ref class MEPSection : IDisposable
Remarks
 This is the base class for duct and pipe section. This class is mainly for pressure loss calculation. It is a series of connected elements (segments - ducts or pipes, fittings, terminals and accessories). All section members should have same flow analysis properties: Flow, Size, Velocity, Friction and Roughness. One section member element which contains more than one connector can belongs to multiple section. e.g.: One Tee which has 3 connectors, usually, it belongs 3 sections. One segment which connect to a tap will be divided into 2 sections.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.MEPSection
See Also
MEPSection Members
Autodesk.Revit.DB.Mechanical Namespace